app/controllers/programs_controller.rb

SELECT "programs".* FROM "programs"
---
  def index
    @programs = Program.all

INSERT INTO "programs" ("name", "purpose", "contact", "phone", "cost", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @program = Program.new(program_params)

    respond_to do |format|
      if @program.save

UPDATE "programs" SET "name" = $1, "updated_at" = $2 WHERE "programs"."id" = $3  [["name", "Technology Pathways"], ["updated_at", "2015-10-11 07:47:08.798920"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @program.update(program_params)

SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_program
      @program = Program.find(params[:id])