app/controllers/schools_controller.rb

SELECT "schools".* FROM "schools"
---
  def index
    @schools = School.all

INSERT INTO "schools" ("name", "address", "phone", "principal", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_school
      @school = School.find(params[:id])